In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import os
from collections import Counter
print(os.listdir("../input"))
import itertools, collections

['imbd-sf', '.ipynb_checkpoints']

In [2]:
data = pd.read_csv('../input/imbd-sf/data.csv')
data.head(5)

,imdb_id,popularity,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year
0,tt0369610,32.985763,150000000,1513528810,Jurassic World,Chris Pratt|Bryce Dallas Howard|Irrfan Khan|Vi...,Colin Trevorrow,The park is open.,Twenty-two years after the events of Jurassic ...,124,Action|Adventure|Science Fiction|Thriller,Universal Studios|Amblin Entertainment|Legenda...,6/9/2015,5562,6.5,2015
1,tt1392190,28.419936,150000000,378436354,Mad Max: Fury Road,Tom Hardy|Charlize Theron|Hugh Keays-Byrne|Nic...,George Miller,What a Lovely Day.,An apocalyptic story set in the furthest reach...,120,Action|Adventure|Science Fiction|Thriller,Village Roadshow Pictures|Kennedy Miller Produ...,5/13/2015,6185,7.1,2015
2,tt2908446,13.112507,110000000,295238201,Insurgent,Shailene Woodley|Theo James|Kate Winslet|Ansel...,Robert Schwentke,One Choice Can Destroy You,Beatrice Prior must confront her inner demons ...,119,Adventure|Science Fiction|Thriller,Summit Entertainment|Mandeville Films|Red Wago...,3/18/2015,2480,6.3,2015
3,tt2488496,11.173104,200000000,2068178225,Star Wars: The Force Awakens,Harrison Ford|Mark Hamill|Carrie Fisher|Adam D...,J.J. Abrams,Every generation has a story.,Thirty years after defeating the Galactic Empi...,136,Action|Adventure|Science Fiction|Fantasy,Lucasfilm|Truenorth Productions|Bad Robot,12/15/2015,5292,7.5,2015
4,tt2820852,9.335014,190000000,1506249360,Furious 7,Vin Diesel|Paul Walker|Jason Statham|Michelle ...,James Wan,Vengeance Hits Home,Deckard Shaw seeks revenge against Dominic Tor...,137,Action|Crime|Thriller,Universal Pictures|Original Film|Media Rights ...,4/1/2015,2947,7.3,2015

In [3]:
len(data)

1890

# Предобработка датасета

In [4]:
answer_ls = [] # создадим список с ответами. сюда будем добавлять ответы по мере прохождения теста
# сюда можем вписать создание новых колонок в датасете

# 1. У какого фильма из списка самый большой бюджет?
Варианты ответов:
1. The Dark Knight Rises (tt1345836)
2. Spider-Man 3 (tt0413300)
3. Avengers: Age of Ultron (tt2395427)
4. The Warrior's Way	(tt1032751)
5. Pirates of the Caribbean: On Stranger Tides (tt1298650)

In [5]:
data[data.budget == data['budget'].max()][['imdb_id', 'original_title','budget']]

       imdb_id     original_title     budget
491  tt1032751  The Warrior's Way  425000000

In [6]:
# тут вводим ваш ответ и добавлем в его список ответов (сейчас для примера стоит "1")
answer_ls.append(4)#

# 2. Какой из фильмов самый длительный (в минутах)
1. The Lord of the Rings: The Return of the King	(tt0167260)
2. Gods and Generals	(tt0279111)
3. King Kong	(tt0360717)
4. Pearl Harbor	(tt0213149)
5. Alexander	(tt0346491)

In [7]:
data[data.runtime == data['runtime'].max()][['imdb_id', 'original_title','runtime']]

        imdb_id     original_title  runtime
1158  tt0279111  Gods and Generals      214

In [8]:
answer_ls.append(2)#

# 3. Какой из фильмов самый короткий (в минутах)
Варианты ответов:

1. Home on the Range	tt0299172
2. The Jungle Book 2	tt0283426
3. Winnie the Pooh	tt1449283
4. Corpse Bride	tt0121164
5. Hoodwinked!	tt0443536

In [9]:
data[data.runtime == data['runtime'].min()][['imdb_id', 'original_title','runtime']]

       imdb_id   original_title  runtime
769  tt1449283  Winnie the Pooh       63

In [10]:
answer_ls.append(3)#

# 4. Средняя длительность фильма?

Варианты ответов:
1. 115
2. 110
3. 105
4. 120
5. 100

In [11]:
round(data['runtime'].mean())

110

In [12]:
answer_ls.append(2)#

# 5. Средняя длительность фильма по медиане?
Варианты ответов:
1. 106
2. 112
3. 101
4. 120
5. 115

In [13]:
round(data['runtime'].median())

106

In [14]:
answer_ls.append(1)#

# 6. Какой самый прибыльный фильм?
Варианты ответов:
1. The Avengers	tt0848228
2. Minions	tt2293640
3. Star Wars: The Force Awakens	tt2488496
4. Furious 7	tt2820852
5. Avatar	tt0499549

In [15]:
data['profit'] = data.revenue - data.budget
data[data.profit == data['profit'].max()][['imdb_id', 'original_title','revenue', 'budget', 'profit']]

       imdb_id original_title     revenue     budget      profit
239  tt0499549         Avatar  2781505847  237000000  2544505847

In [16]:
answer_ls.append(5)#

# 7. Какой фильм самый убыточный?
Варианты ответов:
1. Supernova tt0134983
2. The Warrior's Way tt1032751
3. Flushed Away	tt0424095
4. The Adventures of Pluto Nash	tt0180052
5. The Lone Ranger	tt1210819

In [17]:
data['profit'] = data.revenue - data.budget
data[data.profit == data['profit'].min()][['imdb_id', 'original_title','revenue', 'budget', 'profit']]

       imdb_id     original_title   revenue     budget     profit
491  tt1032751  The Warrior's Way  11087569  425000000 -413912431

In [18]:
answer_ls.append(2)#

# 8. Сколько всего фильмов в прибыли?
Варианты ответов:
1. 1478
2. 1520
3. 1241
4. 1135
5. 1398

In [19]:
data['profit'] = data.revenue - data.budget
len(data[data.profit > 0])

1478

In [20]:
answer_ls.append(1)#

# 9. Самый прибыльный фильм в 2008 году?
Варианты ответов:
1. Madagascar: Escape 2 Africa	tt0479952
2. Iron Man	tt0371746
3. Kung Fu Panda	tt0441773
4. The Dark Knight	tt0468569
5. Mamma Mia!	tt0795421

In [21]:
data['profit'] = data.revenue - data.budget
data_filtered = data[data.release_year == 2008]
data_filtered[data_filtered.profit == data_filtered.profit.max()][['imdb_id', 'original_title','revenue', 'budget', 'profit']]

       imdb_id   original_title     revenue     budget     profit
600  tt0468569  The Dark Knight  1001921825  185000000  816921825

In [22]:
answer_ls.append(4)#

# 10. Самый убыточный фильм за период с 2012 по 2014 (включительно)?
Варианты ответов:
1. Winter's Tale	tt1837709
2. Stolen	tt1656186
3. Broken City	tt1235522
4. Upside Down	tt1374992
5. The Lone Ranger	tt1210819

In [23]:
data['profit'] = data.revenue - data.budget
data_filtered = data[(data.release_year >= 2012) & (data.release_year <= 2014)]
data_filtered[data_filtered.profit == data_filtered.profit.min()][['imdb_id', 'original_title','revenue', 'budget', 'profit']]

        imdb_id   original_title   revenue     budget     profit
1246  tt1210819  The Lone Ranger  89289910  255000000 -165710090

In [24]:
answer_ls.append(5)#

# 11. Какого жанра фильмов больше всего?
Варианты ответов:
1. Action
2. Adventure
3. Drama
4. Comedy
5. Thriller

In [25]:
def top_genre(data):
    #data_genres = data['genres'].map(lambda x: x.split('|'))
    #data_genres = [x.split('|') for x in data['genres']]
    data_genres = data.genres.str.split('|')
    genres_chain = itertools.chain.from_iterable(data_genres)
    genres_counter = collections.Counter(genres_chain)
    return genres_counter.most_common(1)

top_genre(data)

[('Drama', 782)]

In [26]:
answer_ls.append(3)#

# 12. Какого жанра среди прибыльных фильмов больше всего?
Варианты ответов:
1. Drama
2. Comedy
3. Action
4. Thriller
5. Adventure

In [27]:
data['profit'] = data.revenue - data.budget
data_filtered = data[data.profit > 0]
top_genre(data_filtered)

[('Drama', 560)]

In [28]:
answer_ls.append(1)#

# 13. Кто из режиссеров снял больше всего фильмов?
Варианты ответов:
1. Steven Spielberg
2. Ridley Scott 
3. Steven Soderbergh
4. Christopher Nolan
5. Clint Eastwood

In [29]:
def most_productive_director(data):
    data_parsed = data.director.str.split('|')
    chain = itertools.chain.from_iterable(data_parsed)
    counter = collections.Counter(chain)
    return counter.most_common(1)

most_productive_director(data)

[('Steven Soderbergh', 13)]

In [30]:
answer_ls.append(3)#

# 14. Кто из режиссеров снял больше всего Прибыльных фильмов?
Варианты ответов:
1. Steven Soderbergh
2. Clint Eastwood
3. Steven Spielberg
4. Ridley Scott
5. Christopher Nolan

In [31]:
data['profit'] = data.revenue - data.budget
data_filtered = data[data.profit > 0]
most_productive_director(data_filtered)

[('Ridley Scott', 12)]

In [32]:
answer_ls.append(4)

# 15. Кто из режиссеров принес больше всего прибыли?
Варианты ответов:
1. Steven Spielberg
2. Christopher Nolan
3. David Yates
4. James Cameron
5. Peter Jackson

In [33]:
# data['profit'] = data.revenue - data.budget
# grby_director = data.groupby(['director'])['profit'].sum()
# grby_director[grby_director == grby_director.max()]

In [34]:
data['profit'] = data.revenue - data.budget
data['director_parsed'] = data.director.str.split('|')
df = data.explode('director_parsed')
grby_director = df.groupby(['director_parsed'])['profit'].sum()
grby_director[grby_director == grby_director.max()]

director_parsed
Peter Jackson    5202593685
Name: profit, dtype: int64

In [35]:
answer_ls.append(5)

# 16. Какой актер принес больше всего прибыли?
Варианты ответов:
1. Emma Watson
2. Johnny Depp
3. Michelle Rodriguez
4. Orlando Bloom
5. Rupert Grint

In [36]:
data['profit'] = data.revenue - data.budget
data['cast_parsed'] = data.cast.str.split('|')
s = pd.DataFrame(data.explode('cast_parsed').groupby(['cast_parsed'])['profit'].sum()).reset_index()
s[s.profit == s.profit.max()]

      cast_parsed      profit
1034  Emma Watson  6666245597

In [37]:
answer_ls.append(1)#

# 17. Какой актер принес меньше всего прибыли в 2012 году?
Варианты ответов:
1. Nicolas Cage
2. Danny Huston
3. Kirsten Dunst
4. Jim Sturgess
5. Sami Gayle

In [38]:
data['profit'] = data.revenue - data.budget
data['cast_parsed'] = data.cast.str.split('|')
s = pd.DataFrame(data[data.release_year == 2012].explode('cast_parsed').groupby(['cast_parsed'])['profit'].sum()).reset_index()
s[s.profit == s.profit.min()]

       cast_parsed    profit
253  Kirsten Dunst -68109207

In [39]:
answer_ls.append(3)#

# 18. Какой актер снялся в большем количестве высокобюджетных фильмов? (в фильмах где бюджет выше среднего по данной выборке)
Варианты ответов:
1. Tom Cruise
2. Mark Wahlberg 
3. Matt Damon
4. Angelina Jolie
5. Adam Sandler

In [40]:
mean_budget = data.budget.mean()
cast = data[data.budget > mean_budget].cast.str.split('|')
chain = itertools.chain.from_iterable(cast)
counter = collections.Counter(chain)
counter.most_common(1)

[('Matt Damon', 18)]

In [41]:
answer_ls.append(3)#

# 19. В фильмах какого жанра больше всего снимался Nicolas Cage?  
Варианты ответа:
1. Drama
2. Action
3. Thriller
4. Adventure
5. Crime

In [42]:
data['cast_parsed'] = data.cast.str.split('|')
data['genres_parsed'] = data.genres.str.split('|')
df = data[['cast_parsed', 'genres_parsed']]
df_filter = [any( x == 'Nicolas Cage' for x in y) for y in df.cast_parsed]
chain = itertools.chain.from_iterable(df[df_filter].genres_parsed)
counter = collections.Counter(chain)
counter.most_common(1)

[('Action', 17)]

In [43]:
answer_ls.append(2)#

# 20. Какая студия сняла больше всего фильмов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Paramount Pictures
3. Columbia Pictures
4. Warner Bros
5. Twentieth Century Fox Film Corporation

In [44]:
data['production_companies_parsed'] = data.production_companies.str.split('|')
chain = itertools.chain.from_iterable(data.production_companies_parsed)
counter = collections.Counter(chain)
counter.most_common(1)

[('Universal Pictures', 173)]

In [45]:
l = counter.most_common()
test = ['Universal', 'Paramount', 'Columbia', 'Warner', 'Fox']
for copmany in test:
    f = [i for i,j in l if i.find(copmany) > -1]
    df = pd.DataFrame(l, columns=['company', 'movies'])
    display(df[df['company'].str.contains(copmany)])
    #print(df[df['company'].str.contains(copmany)].movies.sum())

                                     company  movies
0                         Universal Pictures     173
161                        Universal Studios       6
439                                Universal       3
690   Universal Pictures International (UPI)       1
1000               Universal Cartoon Studios       1
1097          Universal Pictures Corporation       1
1548             Universal Animation Studios       1
1589                           Universal CGI       1

                  company  movies
2      Paramount Pictures     122
106     Paramount Vantage      10
240   Paramount Animation       5
1566   Paramount Classics       1

                                                company  movies
3                                     Columbia Pictures     117
13                        Columbia Pictures Corporation      47
172   Province of British Columbia Production Servic...       6
479                                    Columbia TriStar       2
1330     Province of British Columbia Film Incentive BC       1

                                    company  movies
1                              Warner Bros.     168
70                    Warner Bros. Pictures      13
215                  Warner Bros. Animation       5
322       Warner Independent Pictures (WIP)       4
804  Warner Bros. Interactive Entertainment       1

                                     company  movies
4     Twentieth Century Fox Film Corporation     109
19                         Fox 2000 Pictures      35
33                  Fox Searchlight Pictures      24
51                          20th Century Fox      17
98           Twentieth Century Fox Animation      10
229                               Fox Atomic       5
409                          Fox Searchlight       3
466            Fox International Productions       2
864      20th Century Fox Home Entertainment       1
949                    Twentieth Century Fox       1
1062                      Foxtor Productions       1
1751                   Fox Animation Studios       1

In [46]:
answer_ls.append(1)#

# 21. Какая студия сняла больше всего фильмов в 2015 году?
Варианты ответа:
1. Universal Pictures
2. Paramount Pictures
3. Columbia Pictures
4. Warner Bros
5. Twentieth Century Fox Film Corporation

In [47]:
data['production_companies_parsed'] = data.production_companies.str.split('|')
filtered = data[data.release_year == 2015]
chain = itertools.chain.from_iterable(filtered.production_companies_parsed)
counter = collections.Counter(chain)
counter.most_common(1)

[('Warner Bros.', 12)]

In [48]:
answer_ls.append(4)#

# 22. Какая студия заработала больше всего денег в жанре комедий за все время?
Варианты ответа:
1. Warner Bros
2. Universal Pictures (Universal)
3. Columbia Pictures
4. Paramount Pictures
5. Walt Disney

In [49]:
# data['profit'] = data.revenue - data.budget
# data['production_companies_parsed'] = data.production_companies.str.split('|')
# data['genres_parsed'] = data.genres.str.split('|')
# df_filter = [any( x == 'Comedy' for x in y) for y in data.genres_parsed]
# counter = collections.Counter()
# for index, row in data[df_filter].iterrows():
#     for i in row.production_companies_parsed:
#         counter[i] += row.profit
# counter.most_common(1)

In [50]:
data['profit'] = data.revenue - data.budget
data['production_companies_parsed'] = data.production_companies.str.split('|')
data['genres_parsed'] = data.genres.str.split('|')
df_filter = [any( x == 'Comedy' for x in y) for y in data.genres_parsed]
data[df_filter].explode('production_companies_parsed').groupby(['production_companies_parsed']).profit.sum().reset_index().sort_values('profit', ascending=False).head(1)

    production_companies_parsed      profit
644          Universal Pictures  8961545581

In [51]:
answer_ls.append(2)#

# 23. Какая студия заработала больше всего денег в 2012 году?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Columbia Pictures
4. Paramount Pictures
5. Lucasfilm

In [52]:
# data['profit'] = data.revenue - data.budget
# data['production_companies_parsed'] = data.production_companies.str.split('|')
# filtered = data[data.release_year == 2012]
# counter = collections.Counter()
# for index, row in filtered.iterrows():
#     for i in row.production_companies_parsed:
#         counter[i] += row.profit
# counter.most_common(1)

In [53]:
data['profit'] = data.revenue - data.budget
data['production_companies_parsed'] = data.production_companies.str.split('|')
filtered = data[data.release_year == 2012]
filtered.explode('production_companies_parsed').groupby(['production_companies_parsed']).profit.sum().reset_index().sort_values('profit', ascending=False).head(1)

   production_companies_parsed      profit
47           Columbia Pictures  2501406608

In [54]:
answer_ls.append(3)#

# 24. Самый убыточный фильм от Paramount Pictures
Варианты ответа:

1. K-19: The Widowmaker tt0267626
2. Next tt0435705
3. Twisted tt0315297
4. The Love Guru tt0811138
5. The Fighter tt0964517

In [55]:
# data['profit'] = data.revenue - data.budget
# data['production_companies_parsed'] = data.production_companies.str.split('|')
# df_filter = [any( x == 'Paramount Pictures' for x in y) for y in data.production_companies_parsed]
# data[data.profit == data[df_filter].profit.min()][['original_title', 'imdb_id', 'profit']]

In [56]:
data['profit'] = data.revenue - data.budget
data['production_companies_parsed'] = data.production_companies.str.split('|')
df_filter = [any( x == 'Paramount Pictures' for x in y) for y in data.production_companies_parsed]
filtered = data[df_filter]
filtered[filtered.profit == filtered.profit.min()][['original_title', 'imdb_id', 'profit']]

           original_title    imdb_id    profit
926  K-19: The Widowmaker  tt0267626 -64831034

In [57]:
answer_ls.append(1)#

# 25. Какой Самый прибыльный год (заработали больше всего)?
Варианты ответа:
1. 2014
2. 2008
3. 2012
4. 2002
5. 2015

In [58]:
data['profit'] = data.revenue - data.budget
data_gr = data.groupby(['release_year']).profit.sum().reset_index()
data_gr[data_gr.profit == data_gr.profit.max()]

    release_year       profit
15          2015  18668572378

In [59]:
answer_ls.append(5)#

# 26. Какой Самый прибыльный год для студии Warner Bros?
Варианты ответа:
1. 2014
2. 2008
3. 2012
4. 2010
5. 2015

In [60]:
data['profit'] = data.revenue - data.budget
data['production_companies_parsed'] = data.production_companies.str.split('|')
d_e = data.explode('production_companies_parsed')[['production_companies_parsed', 'profit', 'release_year']]
f = d_e.production_companies_parsed.str.find('Warner Bros') > -1
d_e[f].groupby('release_year').profit.sum().reset_index().sort_values('profit', ascending=False).head(1)

    release_year      profit
14          2014  2292949646

In [61]:
answer_ls.append(1)#

# 27. В каком месяце за все годы суммарно вышло больше всего фильмов?
Варианты ответа:
1. Январь
2. Июнь
3. Декабрь
4. Сентябрь
5. Май

In [62]:
#data['release_month'] = [ x.split('/')[0] for x in data['release_date'] ]
data['release_month'] = data.release_date.str.split('/').apply(lambda x: x[0])
gr = data.groupby(by = 'release_month').count()
gr[gr.imdb_id == gr.imdb_id.max()].reset_index()[['release_month', 'imdb_id']]

  release_month  imdb_id
0             9      227

In [63]:
answer_ls.append(4)#

# 28. Сколько суммарно вышло фильмов летом? (за июнь, июль, август)
Варианты ответа:
1. 345
2. 450
3. 478
4. 523
5. 381

In [64]:
data['release_month'] = [ x.split('/')[0] for x in data['release_date'] ]
gr = data.groupby(by = 'release_month').count()
gr.imdb_id[['6','7','8']].sum()

450

In [65]:
answer_ls.append(2)#

# 29. Какой режисер выпускает (суммарно по годам) больше всего фильмов зимой?
Варианты ответов:
1. Steven Soderbergh
2. Christopher Nolan
3. Clint Eastwood
4. Ridley Scott
5. Peter Jackson

In [66]:
data['director_parsed'] = data.director.str.split('|')
data['release_month'] = [ int(x.split('/')[0]) for x in data['release_date'] ]
winter = [1, 2, 12]
df_filter = [any( y == x for x in winter) for y in data.release_month]
#data[df_filter].head(10)
chain = itertools.chain.from_iterable(data[df_filter].director_parsed)
counter = collections.Counter(chain)
counter.most_common(1)

[('Peter Jackson', 7)]

In [67]:
answer_ls.append(5)#

# 30. Какой месяц чаще всего по годам самый прибыльный?
Варианты ответа:
1. Январь
2. Июнь
3. Декабрь
4. Сентябрь
5. Май

In [68]:
data['profit'] = data.revenue - data.budget
data['release_month'] = [ int(x.split('/')[0]) for x in data['release_date'] ]
counter = collections.Counter()
grouped = data[['release_year', 'release_month', 'profit']].groupby('release_year')
for name, group in grouped:
    month_profit = group.groupby('release_month')['profit'].sum().reset_index()
    month_max = month_profit[month_profit.profit == month_profit.profit.max()].iloc[0]['release_month']
    counter[month_max] += 1
pd.DataFrame(counter.most_common(1), columns = ['month', 'count'])

   month  count
0      6      7

In [69]:
data['profit'] = data.revenue - data.budget
data['release_month'] = [ int(x.split('/')[0]) for x in data['release_date'] ]
piv = data.pivot_table(values='profit', index=['release_year'], columns=['release_month'], aggfunc = 'sum')
piv.idxmax(axis = 1).value_counts().head(1)

6    7
dtype: int64

In [70]:
answer_ls.append(2)#

# 31. Названия фильмов какой студии в среднем самые длинные по количеству символов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Jim Henson Company, The
4. Paramount Pictures
5. Four By Two Productions

In [71]:
# data['production_companies_parsed'] = [ x.split('|') for x in data['production_companies'] ]
# data['original_title_len'] = [ len(x) for x in data['original_title']]
# chain = itertools.chain.from_iterable(data.production_companies_parsed)
# production_companies = set(chain)
# counter = collections.Counter()
# for company in production_companies:
#     filter = [ company in i for i in data.production_companies_parsed]
#     counter[company] = data[filter]['original_title_len'].mean()
# counter.most_common(1)

In [72]:
data['production_companies_parsed'] = [ x.split('|') for x in data['production_companies'] ]
# data['original_title_len'] = [ len(x) for x in data['original_title']]
data['original_title_len'] = data['original_title'].str.len()
data_e = data.explode('production_companies_parsed')[['production_companies_parsed', 'original_title_len']]
companies = data_e.groupby('production_companies_parsed').mean().reset_index()
companies[companies.original_title_len == companies.original_title_len.max()]

    production_companies_parsed  original_title_len
584     Four By Two Productions                83.0

In [73]:
answer_ls.append(5)#

# 32. Названия фильмов какой студии в среднем самые длинные по количеству слов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Jim Henson Company, The
4. Paramount Pictures
5. Four By Two Productions

In [74]:
# data['production_companies_parsed'] = [ x.split('|') for x in data['production_companies'] ]
# data['original_title_words'] = [ len(x.split(' ')) for x in data['original_title']]
# chain = itertools.chain.from_iterable(data.production_companies_parsed)
# production_companies = set(chain)
# counter = collections.Counter()
# for company in production_companies:
#     filter = [ company in i for i in data.production_companies_parsed]
#     counter[company] = data[filter]['original_title_words'].mean()
# counter.most_common(1)

In [75]:
data['production_companies_parsed'] = [ x.split('|') for x in data['production_companies'] ]
# data['original_title_words'] = [ len(x.split(' ')) for x in data['original_title']]
data['original_title_words'] = data['original_title'].str.split().str.len()
data_e = data.explode('production_companies_parsed')[['production_companies_parsed', 'original_title_words']]
companies = data_e.groupby('production_companies_parsed').mean().reset_index()
companies[companies.original_title_words == companies.original_title_words.max()]

    production_companies_parsed  original_title_words
584     Four By Two Productions                  12.0

In [76]:
answer_ls.append(5)#

# 33. Сколько разных слов используется в названиях фильмов?(без учета регистра)
Варианты ответа:
1. 6540
2. 1002
3. 2461
4. 28304
5. 3432

In [77]:
#import string
#table = str.maketrans('', '', string.punctuation)
#d = data['original_title_parsed'] = data['original_title'].str.lower().str.translate(table).str.split(' ')

d = data['original_title_parsed'] = data['original_title'].str.lower().str.split(' ')
chain = itertools.chain.from_iterable(d)
words = [ i for i in set(chain) if i != '']
len(words)

2461

In [78]:
answer_ls.append(3)#

# 34. Какие фильмы входят в 1 процент лучших по рейтингу?
Варианты ответа:
1. Inside Out, Gone Girl, 12 Years a Slave
2. BloodRayne, The Adventures of Rocky & Bullwinkle
3. The Lord of the Rings: The Return of the King
4. 300, Lucky Number Slevin

In [79]:
d = data[['vote_average', 'original_title']].sort_values(by=['vote_average'], ascending=False).reset_index()
d_1p = d.iloc[:len(data) // 100]

test = {
1:[['Inside Out', 'Gone Girl', '12 Years a Slave']],
2:[['BloodRayne', 'The Adventures of Rocky & Bullwinkle']],
3:[['The Lord of the Rings: The Return of the King','Upside Down']],
4:[['300', 'Lucky Number Slevin']],
5:[['Inside Out','The Lord of the Rings: The Return of the King','300', 'Upside Down']]
}

df = pd.DataFrame.from_dict(test, orient='index', columns=['movies']).reset_index()
df['result'] = [ all([ any(d_1p.original_title == test_m) for test_m in test_ms]) for test_ms in df.movies]
df

   index                                             movies  result
0      1          [Inside Out, Gone Girl, 12 Years a Slave]    True
1      2  [BloodRayne, The Adventures of Rocky & Bullwin...   False
2      3  [The Lord of the Rings: The Return of the King...   False
3      4                         [300, Lucky Number Slevin]   False
4      5  [Inside Out, The Lord of the Rings: The Return...   False

In [80]:
answer_ls.append(1)

# 35. Какие актеры чаще всего снимаются в одном фильме вместе
Варианты ответа:
1. Johnny Depp & Helena Bonham Carter
2. Hugh Jackman & Ian McKellen
3. Vin Diesel & Paul Walker
4. Adam Sandler & Kevin James
5. Daniel Radcliffe & Rupert Grint

In [81]:
data['cast_parsed'] = [sorted(d) for d in data.cast.str.split('|')]
c = collections.Counter(chain)
for df in data.cast_parsed:
    for i in range(len(df) - 1):
        for j in range(1, len(df) - i):
            c[df[i] +' & ' + df[i+j]] += 1
c.most_common(5)

[('Daniel Radcliffe & Emma Watson', 8),
 ('Daniel Radcliffe & Rupert Grint', 8),
 ('Emma Watson & Rupert Grint', 8),
 ('Ben Stiller & Owen Wilson', 6),
 ('Helena Bonham Carter & Johnny Depp', 6)]

In [82]:
answer_ls.append(5)#

# 36. У какого из режиссеров выше вероятность выпустить фильм в прибыли? (5 баллов)101
Варианты ответа:
1. Quentin Tarantino
2. Steven Soderbergh
3. Robert Rodriguez
4. Christopher Nolan
5. Clint Eastwood

In [83]:
data['profit'] = data.revenue - data.budget
data['director_parsed'] = data.director.str.split('|')
ans = ['Quentin Tarantino','Steven Soderbergh','Robert Rodriguez','Christopher Nolan','Clint Eastwood']
df = data.explode('director_parsed')

df1_all = pd.DataFrame(df.groupby('director_parsed')['profit'].count()).reset_index()
df1_all.columns = ['director', 'number_movies']

df1_positive = pd.DataFrame(df[df.profit > 0].groupby('director_parsed')['profit'].count()).reset_index()
df1_positive.columns = ['director', 'pos_profit']

directors = df1_all.merge(df1_positive, on='director', how='left').fillna(0)
directors['percent'] = directors.pos_profit / directors.number_movies *100
directors.sort_values(by=['percent','number_movies'], ascending=False, inplace=True)
filter_ans = [ d in ans for d in directors.director]
display(directors[filter_ans])
directors[filter_ans].head(1)

              director  number_movies  pos_profit     percent
151  Christopher Nolan              8         8.0  100.000000
748  Quentin Tarantino              7         6.0   85.714286
157     Clint Eastwood             12        10.0   83.333333
902  Steven Soderbergh             13        10.0   76.923077
791   Robert Rodriguez             11         8.0   72.727273

              director  number_movies  pos_profit  percent
151  Christopher Nolan              8         8.0    100.0

In [84]:
answer_ls.append(4)#

# Submission

In [85]:
len(answer_ls)

36

In [86]:
pd.DataFrame({'Id':range(1,len(answer_ls)+1), 'Answer':answer_ls}, columns=['Id', 'Answer'])

    Id  Answer
0    1       4
1    2       2
2    3       3
3    4       2
4    5       1
5    6       5
6    7       2
7    8       1
8    9       4
9   10       5
10  11       3
11  12       1
12  13       3
13  14       4
14  15       5
15  16       1
16  17       3
17  18       3
18  19       2
19  20       1
20  21       4
21  22       2
22  23       3
23  24       1
24  25       5
25  26       1
26  27       4
27  28       2
28  29       5
29  30       2
30  31       5
31  32       5
32  33       3
33  34       1
34  35       5
35  36       4